<!doctype html>
<html lang="en" style="height:100%;">
  <head>
    <!-- Required meta tags -->
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1, shrink-to-fit=no">

    <!-- Bootstrap CSS -->
    <link rel="stylesheet" href="https://stackpath.bootstrapcdn.com/bootstrap/4.4.1/css/bootstrap.min.css" integrity="sha384-Vkoo8x4CGsO3+Hhxv8T/Q5PaXtkKtu6ug5TOeNV6gBiFeWPGFN9MuhOf23Q9Ifjh" crossorigin="anonymous">
<link rel="stylesheet" type="text/css" href="Templates/help.css" />
    <title>FlowerShop</title>
  </head>
  <body style="background:white; margin:1%">
<a href="#" onclick="history.back(-1);" style="color:black; font-size:20pt">
Назад
</a>
<div style="text-align:center">
<h2> Руководство по работе с приложением </h2>
<hr>
Для начала работы вам необходимо пройти аутентификацию. Введите свой логин и пароль в соответствующую форму и нажмите "Войти":
<p><img class="small" src="Img/help1.jpg" /></p>
Если логин и пароль верны, вы увидите главную страницу приложения. Для того, чтобы перейти к работе с таблицами, кликните на <font color=#fbc918>соответствующую надпись</font>.<br>
Для выхода из учетной записи вы можете кликнуть на строку" <font color=#4047cf> Завершить работу</font>" в правом нижнем углу экрана.
<p><img  class="big" src="Img/help2.jpg" /></p>
После перехода на страницу для работы с таблицами вы увидите следующее меню, в котором требуется выбрать одну из таблиц из выпадающего списка.
<p><img  class="small"  src="Img/help2-1.jpg" /></p>
После выбора таблицы необходимо нажать на кнопку "показать". В случае, если подключение к базе данных успешно, выбранная таблица отобразится на экране, а под выпадающим списком с таблицами появится меню выбора действий:
<p><img class="big" src="Img/help2-2.jpg" /></p>
В меню выбора действий есть несколько опций на выбор: 
<p><img class="small" src="Img/help2-3.jpg" /></p>
В случае, если вам необходимо добавить новую строку в таблицу, вы должны выбрать соответствующую опцию.<br>
После этого появится список столбцов, которые необходимо заполнить для добавления новой строки. <br>
После заполнения всех столбцов необходимо нажать на кнопку "Добавить", после чего вы увидите сообщение об успешной вставке строки или <br> 
в случае, если данные были введены неверно, вставка не произойдет, и отобразится сообщение об ошибке
<p><img class="small" src="Img/help2-4.jpg" /></p>
В случае, если вам необходимо изменить строку в таблице, вы должны выбрать соответствующую опцию.<br>
После этого на экране появится выпадающий список полей выбранной таблицы. В этом списке вам нужно выбрать поле, значение которого нужно изменить.<br>
Затем необходимо в текстовое поле ввести первичный ключ, который соответствует изменяемой строке. И наконец, в следующем текстовом поле вы можете ввести новое значение столбца.<br>
Для применения изменений необходимо нажать на кнопку "Изменить"
<p><img class="small" src="Img/help2-5.jpg" /></p>
В случае, если вам необходимо удалить строку из таблицы, вы должны выбрать соответствующую опцию.<br>
После выбора опции "удалить строку", вы увидите текстовое поле, в которое необходимо ввести первичный ключ, соответствующий удаляемой строке.<br>
Для удаления строки, нажмте на кнопку "Удалить"
<p><img class="small" src="Img/help2-6.jpg" /></p>
Для просмотра и печати отчетов, вернитесь на главную страницу и нажмите на  <font color=#26af4e> кнопку в левом верхнем углу экрана</font>:
<p><img class="big" src="Img/help3-1.jpg" /></p>
При входе на эту страницу вы увидите следующее меню, в котором необходимо выбрать таблицу, которая будет вставлена в отчет:
<p><img class="small" src="Img/help3-2.jpg" /></p>
После выбора таблицы и нажатия на кнопку, справа появится форма, в которой отображено текущее содержание отчета:
<p><img class="big" src="Img/help3-3.jpg" /></p>
При желании, вы можете изменить название отчета, добавить номер документа, добавить ИНН организации, добавить ФИО управляющего, изменить дату составления отчета и добавить печать организации.<br>
Для данных действий изпользуются поля ввода текста, выбора даты, а также флажок, который может быть снят или установлен.
<p><img class="small" src="Img/help3-4.jpg" /></p>
После ввода дополнительных данных, вы можете нажать на кнопку "Применить" и содержимое отчета изменится в зависимости от введенных данных:
<p><img class="big" src="Img/help3-5.jpg" /></p>
Для того, чтобы напечатать готовый отчет, необходимо нажать на <font color=#ba7a56>кнопку с пиктограммой принтера</font>: 
<p><img class="small" src="Img/help3-6.jpg" /></p>
Затем, в зависимости от используемого браузера, на экране появится всплывающее меню настроек печати, в котором можно выбрать тип печати, формат бумаги, поля, масштаб и начать печать документа:
<p><img class="big" src="Img/help3-7.jpg" /></p>
</div>
<footer >
</footer>
    <script src="https://code.jquery.com/jquery-3.4.1.min.js" integrity="sha384-J6qa4849blE2+poT4WnyKhv5vZF5SrPo0iEjwBvKU7imGFAV0wwj1yYfoRSJoZ+n" crossorigin="anonymous"></script>
    <script src="https://cdn.jsdelivr.net/npm/popper.js@1.16.0/dist/umd/popper.min.js" integrity="sha384-Q6E9RHvbIyZFJoft+2mJbHaEWldlvI9IOYy5n3zV9zzTtmI3UksdQRVvoxMfooAo" crossorigin="anonymous"></script>
    <script src="https://stackpath.bootstrapcdn.com/bootstrap/4.4.1/js/bootstrap.min.js" integrity="sha384-wfSDF2E50Y2D1uUdj0O3uMBJnjuUD4Ih7YwaYd1iqfktj0Uod8GCExl3Og8ifwB6" crossorigin="anonymous"></script>
  </body>
</html>